{
    "rooms": {
        "entrance": {
            "description": "Cold air drifts from the depths. The torch sconces here are fresh, as if someone prepared this path for you. North leads to the crossroads of the Order.",
            "exits": { "north": "fork" },
            "items": ["torch"],
            "dark": false
        },
        "fork": {
            "description": "A crossroads of the Order. From here, you can go north to the Vigil Hall, east to a tunnel of voices, west to a dripping corridor, or south back to the cold entrance.",
            "exits": {
                "south": "entrance",
                "north": "left_hall",
                "east": "right_tunnel",
                "west": "dripstone_walk"
            },
            "items": [],
            "dark": false
        },
        "dripstone_walk": {
            "description": "Water ticks from the ceiling. Hairline seams crisscross the stone, and scrapes score the walls at knee height. A shadowy path leads north to a storage room. Another leads west into a dark void. The path west is rumored to lead to a resonant stone, and only sign of light is from the fork whence you came in.",
            "exits": {
                "east": "fork",
                "west": "pit_of_teeth",
                "north": "storage_room"
            },
            "items": [],
            "dark": true
        },
        "pit_of_teeth": {
            "description": "The crust gives way; stone vanishes beneath you. For a heartbeat you see iron points glistening below. Search for a keystone is what brought you here, but it's a trap that ended your journey. Did you even need a keystone?",
            "exits": {},
            "items": [],
            "dark": false,
            "trap": true
        },
        "storage_room": {
            "description": "The Wardens’ store at last: rotting casks and moldy canvas. Beneath a collapsed crate you hope to find riches, but taking a look requires a torch. South leads to the dripping corridor.",
            "exits": { "south": "dripstone_walk" },
            "items": ["key"],
            "dark": true
        },
        "left_hall": {
            "description": "Battle cries hum if you speak. Banners of command hang torn over the west door. You may go south back to the crossroads, north to the ancient library, east to a sealed archway, or west to the guard chamber.",
            "exits": {
                "south": "fork",
                "north": "ancient_library",
                "east": "sealed_archway",
                "west": "guard_chamber"
            },
            "items": [],
            "dark": false
        },
        "guard_chamber": {
            "description": "Rusty spears line a rack; a ledger lists watch rotations that ended a century ago. From here, you can go east back to the left hall or north to the armory.",
            "exits": {
                "east": "left_hall",
                "north": "armory"
            },
            "items": [],
            "dark": false
        },
        "armory": {
            "description": "Polished once, dulled now. The commander’s standards point onward. You can go south back to the guard chamber or north to the commander quarters.",
            "exits": {
                "south": "guard_chamber",
                "north": "commander_quarters"
            },
            "items": [],
            "dark": false
        },
        "commander_quarters": {
            "description": "Maps and orders cover a desk, the remnants of a commander’s long watch. A velvet tray lies among the clutter, its purpose not immediately clear. Firestones are said to be great reflectors of light. South leads back to the armory.",
            "exits": { "south": "armory" },
            "items": ["firestone"],
            "dark": true
        },
        "ancient_library": {
            "description": "Books sag in their bindings. Above the lintel a chant is carved: 'Listen, then speak.' From here, you can go south back to the left hall or north to the scriptorium.",
            "exits": {
                "south": "left_hall",
                "north": "scriptorium"
            },
            "items": [],
            "dark": true
        },
        "scriptorium": {
            "description": "Cut quills and inkstones. Oak-gall and candle soot scent the air, as if the scribes just left. Only way out is south to the ancient library.",
            "exits": { "south": "ancient_library" },
            "items": [],
            "dark": true
        },
        "sealed_archway": {
            "description": "Water channels hint at the River’s path. East leads toward the seal, and from the north cold and moist air seeps hinting of a pool. You can go west back to the left hall, east to the antechamber, or north to investigate the airflow.",
            "exits": {
                "west": "left_hall",
                "east": "antechamber",
                "north": "deep_pool"
            },
            "items": [],
            "dark": false
        },
        "antechamber": {
            "description": "Pedestals and water channels converge on a sealed door. Three sockets for three artifacts—the Triune Seal waits to the east. You can also go west back to the sealed archway, north to a narrow passage, or south to the meditation room.",
            "exits": {
                "west": "sealed_archway",
                "east": "treasure_chamber",
                "north": "narrow_passage",
                "south": "meditation_room"
            },
            "items": [],
            "dark": false,
            "locks": {
                "east": ["key", "firestone", "relic"]
            }
        },
        "meditation_room": {
            "description": "Stone benches face a carved altar. The silence here feels chosen, not empty. Antechamber is back to the North.",
            "exits": { "north": "antechamber" },
            "items": [],
            "dark": false
        },
        "treasure_chamber": {
            "description": "Pillars encircle a gilded chest. The hum of the seal fades as you enter—the cave listens for what you'll do next. You may go west back to the antechamber or north to the shrine.",
            "exits": {
                "west": "antechamber",
                "north": "shrine"
            },
            "items": ["treasure"],
            "dark": false
        },
        "shrine": {
            "description": "An austere alcove facing the vault. Ash lines the floor as if candles burned while someone decided whether to open the door at all. Three sockets for three artifacts—the Triune Seal waits to the south. To the west lies the narrow passage.",
            "exits": {
                "south": "treasure_chamber",
                "west": "narrow_passage"
            },
            "items": [],
            "dark": true,
            "locks": {
                "south": ["key", "firestone", "relic"]
            }
        },
        "narrow_passage": {
            "description": "Stone presses your shoulders; only what truly matters can come with you. You can go west to the secret corridor, east to the shrine, or south to the antechamber. Your limited inventory contains only what is worthy.",
            "exits": {
                "west": "secret_corridor",
                "east": "shrine",
                "south": "antechamber"
            },
            "items": [],
            "dark": false,
            "inventory_limit": 2
        },
        "secret_corridor": {
            "description": "Tool marks show a hurried dig. Only two ways: The north path is rumored to hide an ancient artifact, to your east lies a narrow passage.",
            "exits": {
                "east": "narrow_passage",
                "north": "miasma_vault"
            },
            "items": [],
            "dark": false
        },
        "hidden_chamber": {
            "description": "The oratory above the River: offerings of salt and glass beads. On an altar the **relic** hums faintly when you speak. South leads back to the river hall.",
            "exits": { "south": "river_hall" },
            "items": ["relic"],
            "dark": false
        },
        "river_hall": {
            "description": "Flagstones polished by centuries of feet. The river’s thunder muffles thought;. West leads to the underground river, east slides down to a narrow corridor. Echings on the north wall read, 'Holding the firestone against a torch lightens hidden paths.'",
            "exits": {
                "east": "secret_corridor",
                "west": "underground_river",
                "north": "hidden_chamber"
            },
            "items": [],
            "dark": false
        },
        "underground_river": {
            "description": "Warm water murmurs through the dark; your voice returns in broken echoes. East leads to the river hall, north to the waterfall chamber, and south to the deep pool.",
            "exits": {
                "east": "river_hall",
                "north": "waterfall_chamber",
                "south": "deep_pool"
            },
            "items": [],
            "dark": false
        },
        "waterfall_chamber": {
            "description": "A white curtain of water smashes into a pool. Mist beads your skin; sound swallows thought. South leads back to the underground river.",
            "exits": { "south": "underground_river" },
            "items": [],
            "dark": false
        },
        "deep_pool": {
            "description": "Black water yawns beside a slick ledge. The cold here is a warning and a promise. You can go north to the underground river or south to the sealed archway.",
            "exits": { "north": "underground_river",
                        "south": "sealed_archway"
            },
            "items": [],
            "dark": true
        },
        "right_tunnel": {
            "description": "A cool draft and the distant rush of water carry voices that might be yours. Carved signs mention a fire crystal. Is this what the Prologue described? You can go west back to the crossroads, east to the cavern junction, or north to the mining chamber.",
            "exits": {
                "west": "fork",
                "east": "cavern_junction",
                "north": "mining_chamber"
            },
            "items": [],
            "dark": true
        },
        "mining_chamber": {
            "description": "Carts, picks, and narrow tool slits pierce the wall. Scribbles boast of a fire crystal buried ahead. You can go south back to the right tunnel or east to look further.",
            "exits": {
                "south": "right_tunnel",
                "east": "arrow_gallery"
            },
            "items": [],
            "dark": true
        },
        "arrow_gallery": {
            "description": "A soft click; the walls answer in a hail of iron. No exits lead from here. You become one of the many misguided who entered this deadly trap in search for the Firestone.",
            "exits": {},
            "items": [],
            "dark": false,
            "trap": true
        },
        "cavern_junction": {
            "description": "A broad chamber where sound stacks on itself. A sweet, acrid tang stains the low arch to the south. Runic graffiti repeats rumors of *keystones* and *resonances*—false echoes meant to mislead? You can go west back to the right tunnel, north to the crystal cave, or east to the echo chamber.",
            "exits": {
                "west": "right_tunnel",
                "north": "crystal_cave",
                "east": "echo_chamber"
            },
            "items": [],
            "dark": false
        },
        "crystal_cave": {
            "description": "Sheets of crystal ring when you pass, turning your footsteps into chords. Only was out is south, back to the cavern junction.",
            "exits": { "south": "cavern_junction" },
            "items": [],
            "dark": false
        },
        "miasma_vault": {
            "description": "The floor breathes; the ceiling exhales a pale cloud. Your lungs seize before you can turn. Not all artifacts are relics",
            "exits": {},
            "items": [],
            "dark": false,
            "trap": true
        },
        "echo_chamber": {
            "description": "A perfect dome of sound. Whisper long enough and the walls return three words: **Warden — Commander — Oratory**. Beware the imitators. Only way out is west, back to the cavern junction.",
            "exits": { "west": "cavern_junction" },
            "items": [],
            "dark": false
        }
    },
    "start": "entrance"
}
